---
kind: other
id: Methods.T:Autodesk.Revit.UI.IExternalCommandAvailability
source: html/e4425b27-df3c-4c67-8c47-9c930cd893ef.htm
---
# IExternalCommandAvailability Methods

Implement this method to provide control over whether your external command is enabled or disabled.